Revit 2024 API
BuiltInFailures.ElectricalFailures.CircuitsOverlapDisconnectCircuits Property
 More than one circuit falls onto the same slot. These circuits will be disconnected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircuitsOverlapDisconnectCircuits { get; }
Visual Basic
Public Shared ReadOnly Property CircuitsOverlapDisconnectCircuits As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircuitsOverlapDisconnectCircuits {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace